; domain
(define (domain gripper-strips)
 (:requirements :strips :typing :constraints) 
 (:types type_1 object type_3 type_2)
 (:predicates (pred_1 ?v7 - type_3 ?v1 - type_1)
 	      (pred_2 ?v2 - object ?v1 - type_1)
	      (pred_3 ?v7 - type_3 ?v5 - type_2)
	      (pred_4 ?v7 - type_3 ?v2 - object ?v5 - type_2))

   (:action op_1
       :parameters  (?v7 - type_3 ?v4 ?v3 - type_1)
       :precondition (and  (pred_1 ?v7 ?v4))
       :effect (and  (pred_1 ?v7 ?v3)
		     (not (pred_1 ?v7 ?v4))))

   (:action op_3
       :parameters (?v7 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_2 ?v8 ?v6) (pred_1 ?v7 ?v6) (pred_3 ?v7 ?v5))
       :effect (and (pred_4 ?v7 ?v8 ?v5)
		    (not (pred_2 ?v8 ?v6)) 
		    (not (pred_3 ?v7 ?v5))))

   (:action op_2
       :parameters (?v7 - type_3 ?v8 - object ?v6 - type_1 ?v5 - type_2)
       :precondition  (and  (pred_4 ?v7 ?v8 ?v5) (pred_1 ?v7 ?v6))
       :effect (and (pred_2 ?v8 ?v6)
		    (pred_3 ?v7 ?v5)
		    (not (pred_4 ?v7 ?v8 ?v5)))))

; problem
(define (problem gripper-2-4-3)
(:domain gripper-strips)
(:objects obj_05 obj_09 - type_1
obj_06 obj_07 obj_04 obj_12 - type_2
obj_01 obj_08 obj_13 obj_02 - type_3
obj_03 obj_11 obj_10 - object)
(:init
(pred_1 obj_05 obj_13)
(pred_3 obj_05 obj_06)
(pred_3 obj_05 obj_07)
(pred_1 obj_09 obj_08)
(pred_3 obj_09 obj_04)
(pred_3 obj_09 obj_12)
(pred_2 obj_03 obj_13)
(pred_2 obj_11 obj_13)
(pred_2 obj_10 obj_02)
)
(:goal
(and
(pred_2 obj_03 obj_13)
(pred_2 obj_11 obj_02)
(pred_2 obj_10 obj_02)
)
)

(:constraints
  (always (not (pred_1 obj_05 obj_02)))
)
)

; plan
1. (op_1 obj_09 obj_08 obj_13)
   deleted: (pred_1 obj_09 obj_08)
   added: (pred_1 obj_09 obj_13)
   goals met: 2 of 3
2. (op_3 obj_09 obj_11 obj_13 obj_12)
   deleted: (pred_2 obj_11 obj_13) (pred_3 obj_09 obj_12)
   added: (pred_4 obj_09 obj_11 obj_12)
   goals met: 2 of 3
3. (op_1 obj_09 obj_13 obj_02)
   deleted: (pred_1 obj_09 obj_13)
   added: (pred_1 obj_09 obj_02)
   goals met: 2 of 3
4. (op_2 obj_09 obj_11 obj_02 obj_12)
   deleted: (pred_4 obj_09 obj_11 obj_12)
   added: (pred_2 obj_11 obj_02) (pred_3 obj_09 obj_12)
   goals met: 3 of 3
